<a href="https://colab.research.google.com/github/CatMolnia/BOOKS_study/blob/main/Pandas%20%D0%B2%20%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D0%B8/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0%202.%20%D0%9E%D0%B1%D1%8A%D0%B5%D0%BA%D1%82%20Series.ipynb/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0_2_%D0%9E%D0%B1%D1%8A%D0%B5%D0%BA%D1%82_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

"""---2. ОБОЪЕКТ SERIES---"""

"""---2.1 ОБЗОР SERIES---"""

"""---2.1.3. Пользовательские индексы для Series---"""

In [2]:
import pandas as pd
import numpy as np

In [5]:
ice_cream_flavors = [
  "Chocolate",
  "Vanilla",
  "Strawberry",
  "Rum Raisin",
]

pd.Series(ice_cream_flavors) # создание объекта Series

0     Chocolate
1       Vanilla
2    Strawberry
3    Rum Raisin
dtype: object

In [6]:
days_of_week = ("Monday", "Wednesday", "Friday", "Saturday")

In [7]:
pd.Series(ice_cream_flavors, days_of_week)
pd.Series(data = ice_cream_flavors, index = days_of_week)

Monday        Chocolate
Wednesday       Vanilla
Friday       Strawberry
Saturday     Rum Raisin
dtype: object

In [8]:
bunch_of_bools = [True, False, False]
pd.Series(bunch_of_bools)

0     True
1    False
2    False
dtype: bool

In [9]:
stock_prices = [985.32, 950.44]
time_of_day = ["Open", "Close"]
pd.Series(data = stock_prices, index = time_of_day)

Open     985.32
Close    950.44
dtype: float64

In [10]:
lucky_numbers = [4, 8, 15, 16, 23, 42]
pd.Series(lucky_numbers)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [12]:
lucky_numbers = [4, 8, 15, 16, 23, 42]
pd.Series(lucky_numbers, dtype = "float") # принудительно меняем формат передаваемых данных

0     4.0
1     8.0
2    15.0
3    16.0
4    23.0
5    42.0
dtype: float64